print("Приветствую Вас!:)")
user_name = input("Введите Ваше имя: ")


# Запрашиваем возраст, делаем проверку возраста на ValueError
# и отрицательное число и в случае ошибки возвращаем запрос возраста
while True:
    try:
        user_age = int(input("Введите Ваш возраст: "))

        if user_age <= 0:
            print("Ошибка: возраст должен быть больше 0")
        else:
            break

    except ValueError:
        print("Ошибка: введите возраст цифрами, число должно быть целым")


# Запрашиваем вес, делаем проверку на ValueError
# и отрицательное число и в случае ошибки возвращаем запрос веса
while True:
    try:
        user_weight = float(input("Введите Ваш вес в кг: "))

        if user_weight <= 0:
            print("Ошибка: вес должен быть больше 0")
        else:
            break

    except ValueError:
        print("Ошибка: введите вес цифрами и через точку, например: 80.5")


# Запрашиваем рост, делаем проверку на ValueError
# и отрицательное число и в случае ошибки возвращаем запрос роста
while True:
    try:
        user_height = float(input("Введите Ваш рост в метрах: "))

        if user_height <= 0:
            print("Ошибка: рост должен быть больше 0")
        else:
            break

    except ValueError:
        print("Ошибка: введите рост цифрами и через точку, например: 1.75")

print(f"Отчет для пользователя: {user_name}, {user_age} г.")

# расчёт индекса массы тела
bmi = user_weight / (user_height ** 2)

# округляем значение bmi до 1 знака после запятой
rounded_bmi = round(bmi, 1)
print(f"{user_name}, Ваш индекс массы тела: {rounded_bmi}")

# создаем константы для расчетов
WATER_PER_KG = 30
WATER_PER_L = 1000

# рассчитываем кол-во воды на кг
water_ml = user_weight * WATER_PER_KG

# переводим мл в л
water_l = water_ml / WATER_PER_L

# выводим рекомендуемую нормы воды и округляем ее до 2 знаков после запятой
print(f"Рекомендуемая норма воды: {water_l:.2f} литров в день")
print("Расчет окончен. Будьте здоровы!")
